In [2]:
import pandas as pd

In [37]:
cars1 = pd.DataFrame({
    'car_id':[1,2,3,4,5],
    'brand':['Toyota','Honda','Ford','BMW','Audi'],
    'fuel_type':['Petrol','Diesel','Petrol','Diesel','Petrol']
})

In [35]:
cars2 = pd.DataFrame({
    'car_id':[1,2,3,4,5],
    'model':['Corolla','City','Mustang','X5','A4'],
    'fuel_type':['Petrol','Petrol','Petrol','Diesel','Petrol']
})

In [39]:
print(cars1)

   car_id   brand fuel_type
0       1  Toyota    Petrol
1       2   Honda    Diesel
2       3    Ford    Petrol
3       4     BMW    Diesel
4       5    Audi    Petrol

In [41]:
print(cars2)

   car_id    model fuel_type
0       1  Corolla    Petrol
1       2     City    Petrol
2       3  Mustang    Petrol
3       4       X5    Diesel
4       5       A4    Petrol

In [43]:
pd.merge(cars1,cars2, on='car_id')

   car_id   brand fuel_type_x    model fuel_type_y
0       1  Toyota      Petrol  Corolla      Petrol
1       2   Honda      Diesel     City      Petrol
2       3    Ford      Petrol  Mustang      Petrol
3       4     BMW      Diesel       X5      Diesel
4       5    Audi      Petrol       A4      Petrol

In [47]:
pd.merge(cars1,cars2, on=['fuel_type', 'car_id'])

   car_id   brand fuel_type    model
0       1  Toyota    Petrol  Corolla
1       3    Ford    Petrol  Mustang
2       4     BMW    Diesel       X5
3       5    Audi    Petrol       A4

In [49]:
pd.merge(cars1,cars2, on='fuel_type', how='left')

    car_id_x   brand fuel_type  car_id_y    model
0          1  Toyota    Petrol         1  Corolla
1          1  Toyota    Petrol         2     City
2          1  Toyota    Petrol         3  Mustang
3          1  Toyota    Petrol         5       A4
4          2   Honda    Diesel         4       X5
5          3    Ford    Petrol         1  Corolla
6          3    Ford    Petrol         2     City
7          3    Ford    Petrol         3  Mustang
8          3    Ford    Petrol         5       A4
9          4     BMW    Diesel         4       X5
10         5    Audi    Petrol         1  Corolla
11         5    Audi    Petrol         2     City
12         5    Audi    Petrol         3  Mustang
13         5    Audi    Petrol         5       A4

In [51]:
pd.merge(cars1,cars2, on='fuel_type', how='right')

    car_id_x   brand fuel_type  car_id_y    model
0          1  Toyota    Petrol         1  Corolla
1          3    Ford    Petrol         1  Corolla
2          5    Audi    Petrol         1  Corolla
3          1  Toyota    Petrol         2     City
4          3    Ford    Petrol         2     City
5          5    Audi    Petrol         2     City
6          1  Toyota    Petrol         3  Mustang
7          3    Ford    Petrol         3  Mustang
8          5    Audi    Petrol         3  Mustang
9          2   Honda    Diesel         4       X5
10         4     BMW    Diesel         4       X5
11         1  Toyota    Petrol         5       A4
12         3    Ford    Petrol         5       A4
13         5    Audi    Petrol         5       A4

In [53]:
pd.merge(cars1,cars2, on='fuel_type', how='inner')

    car_id_x   brand fuel_type  car_id_y    model
0          1  Toyota    Petrol         1  Corolla
1          1  Toyota    Petrol         2     City
2          1  Toyota    Petrol         3  Mustang
3          1  Toyota    Petrol         5       A4
4          2   Honda    Diesel         4       X5
5          3    Ford    Petrol         1  Corolla
6          3    Ford    Petrol         2     City
7          3    Ford    Petrol         3  Mustang
8          3    Ford    Petrol         5       A4
9          4     BMW    Diesel         4       X5
10         5    Audi    Petrol         1  Corolla
11         5    Audi    Petrol         2     City
12         5    Audi    Petrol         3  Mustang
13         5    Audi    Petrol         5       A4

In [55]:
pd.merge(cars1,cars2, on='fuel_type', how='outer')

    car_id_x   brand fuel_type  car_id_y    model
0          2   Honda    Diesel         4       X5
1          4     BMW    Diesel         4       X5
2          1  Toyota    Petrol         1  Corolla
3          1  Toyota    Petrol         2     City
4          1  Toyota    Petrol         3  Mustang
5          1  Toyota    Petrol         5       A4
6          3    Ford    Petrol         1  Corolla
7          3    Ford    Petrol         2     City
8          3    Ford    Petrol         3  Mustang
9          3    Ford    Petrol         5       A4
10         5    Audi    Petrol         1  Corolla
11         5    Audi    Petrol         2     City
12         5    Audi    Petrol         3  Mustang
13         5    Audi    Petrol         5       A4

In [57]:
pd.concat([cars1,cars2])

   car_id   brand fuel_type    model
0       1  Toyota    Petrol      NaN
1       2   Honda    Diesel      NaN
2       3    Ford    Petrol      NaN
3       4     BMW    Diesel      NaN
4       5    Audi    Petrol      NaN
0       1     NaN    Petrol  Corolla
1       2     NaN    Petrol     City
2       3     NaN    Petrol  Mustang
3       4     NaN    Diesel       X5
4       5     NaN    Petrol       A4

In [93]:
pd.concat([cars1,cars2], keys=['Dataset1','Dataset2'])

            car_id   brand fuel_type    model
Dataset1 0       1  Toyota    Petrol      NaN
         1       2   Honda    Diesel      NaN
         2       3    Ford    Petrol      NaN
         3       4     BMW    Diesel      NaN
         4       5    Audi    Petrol      NaN
Dataset2 0       1     NaN    Petrol  Corolla
         1       2     NaN    Petrol     City
         2       3     NaN    Petrol  Mustang
         3       4     NaN    Diesel       X5
         4       5     NaN    Petrol       A4

In [61]:
pd.concat([cars1,cars2], ignore_index=True)

   car_id   brand fuel_type    model
0       1  Toyota    Petrol      NaN
1       2   Honda    Diesel      NaN
2       3    Ford    Petrol      NaN
3       4     BMW    Diesel      NaN
4       5    Audi    Petrol      NaN
5       1     NaN    Petrol  Corolla
6       2     NaN    Petrol     City
7       3     NaN    Petrol  Mustang
8       4     NaN    Diesel       X5
9       5     NaN    Petrol       A4

In [63]:
pd.concat([cars1,cars2], axis=1)

   car_id   brand fuel_type  car_id    model fuel_type
0       1  Toyota    Petrol       1  Corolla    Petrol
1       2   Honda    Diesel       2     City    Petrol
2       3    Ford    Petrol       3  Mustang    Petrol
3       4     BMW    Diesel       4       X5    Diesel
4       5    Audi    Petrol       5       A4    Petrol

In [65]:
car_prices = pd.DataFrame(
    [[800000, 20, 5],
     [600000, 18, 4],
     [1200000, 10, 6],
     [1500000, 12, 8],
     [700000, 22, 5]],
    columns=['Price', 'Mileage', 'Age'],
    index=['Car1', 'Car2', 'Car3', 'Car4', 'Car5']
)

In [67]:
print(car_prices)

        Price  Mileage  Age
Car1   800000       20    5
Car2   600000       18    4
Car3  1200000       10    6
Car4  1500000       12    8
Car5   700000       22    5

In [91]:
print("\n--------Mean--------\n")
print(car_prices.mean())

--------Mean--------

Price      960000.0
Mileage        16.4
Age             5.6
dtype: float64

In [87]:
print("\n-------Median-------\n")
print(car_prices.median())

-------Median-------

Price      800000.0
Mileage        18.0
Age             5.0
dtype: float64

In [85]:
print("\n-----------Mode----------\n")
print(car_prices.mode())

-----------Mode----------

     Price  Mileage  Age
0   600000       10  5.0
1   700000       12  NaN
2   800000       18  NaN
3  1200000       20  NaN
4  1500000       22  NaN